Chace0219/nRF5SDK-SPI_I2C/SSD_LSMSPI/LSM9D/SparkFunLSM9DS1.c
	return 0;
}

void configMagInt(uint8_t generator, h_lactive activeLow, bool latch)
{
	// Mask out non-generator bits (0-4)
	uint8_t config = (generator & 0xE0);	
	// IEA bit is 0 for active-low, 1 for active-high.
	if (activeLow == INT_ACTIVE_HIGH) config |= (1<<2);
	// IEL bit is 0 for latched, 1 for not-latched
	if (!latch) config |= (1<<1);
	// As long as we have at least 1 generator, enable the interrupt
	if (generator != 0) config |= (1<<0);
	
	mWriteByte(INT_CFG_M, config);
}

void configMagThs(uint16_t threshold)
{
	// Write high eight bits of [threshold] to INT_THS_H_M
	mWriteByte(INT_THS_H_M, (uint8_t)((threshold & 0x7F00) >> 8));
	// Write low eight bits of [threshold] to INT_THS_L_M
	mWriteByte(INT_THS_L_M, (uint8_t)(threshold & 0x00FF));
}

uint8_t getMagIntSrc()
{
	uint8_t intSrc = mReadByte(INT_SRC_M);
	
	// Check if the INT (interrupt active) bit is set
	if (intSrc & (1<<0))
	{
		return (intSrc & 0xFE);
	}
	
	return 0;
}

void sleepGyro(bool enable)
{
	uint8_t temp = xgReadByte(CTRL_REG9);
	if (enable) temp |= (1<<6);
	else temp &= ~(1<<6);
	xgWriteByte(CTRL_REG9, temp);
}

void enableFIFO(bool enable)
{
	uint8_t temp = xgReadByte(CTRL_REG9);
	if (enable) temp |= (1<<1);
	else temp &= ~(1<<1);
	xgWriteByte(CTRL_REG9, temp);
}

void setFIFO(fifoMode_type fifoMode, uint8_t fifoThs)
{
	// Limit threshold - 0x1F (31) is the maximum. If more than that was asked
	// limit it to the maximum.
	uint8_t threshold = fifoThs <= 0x1F ? fifoThs : 0x1F;
	xgWriteByte(FIFO_CTRL, ((fifoMode & 0x7) << 5) | (threshold & 0x1F));
}

uint8_t getFIFOSamples()
{
	return (xgReadByte(FIFO_SRC) & 0x3F);
}

void constrainScales()
{
	if ((settings.gyro.scale != 245) && (settings.gyro.scale != 500) && 
		(settings.gyro.scale != 2000))
	{
		settings.gyro.scale = 245;
	}
		
	if ((settings.accel.scale != 2) && (settings.accel.scale != 4) &&
		(settings.accel.scale != 8) && (settings.accel.scale != 16))
	{
		settings.accel.scale = 2;
	}
		
	if ((settings.mag.scale != 4) && (settings.mag.scale != 8) &&
		(settings.mag.scale != 12) && (settings.mag.scale != 16))
	{
		settings.mag.scale = 4;
	}
}

void xgWriteByte(uint8_t subAddress, uint8_t data)
{
	// Whether we're using I2C or SPI, write a byte using the
	// gyro-specific I2C address or SPI CS pin.
	SPIwriteByte(_xgAddress, subAddress, data);
}

void mWriteByte(uint8_t subAddress, uint8_t data)
{
	// Whether we're using I2C or SPI, write a byte using the
	// accelerometer-specific I2C address or SPI CS pin.
	SPIwriteByte(_mAddress, subAddress, data);
}

uint8_t xgReadByte(uint8_t subAddress)
{
	// Whether we're using I2C or SPI, read a byte using the
	// gyro-specific I2C address or SPI CS pin.
	return SPIreadByte(_xgAddress, subAddress);
}

void xgReadBytes(uint8_t subAddress, uint8_t * dest, uint8_t count)
{
	// Whether we're using I2C or SPI, read multiple bytes using the
	// gyro-specific I2C address or SPI CS pin.
	SPIreadBytes(_xgAddress, subAddress, dest, count);
}

uint8_t mReadByte(uint8_t subAddress)
{
	// Whether we're using I2C or SPI, read a byte using the
	// accelerometer-specific I2C address or SPI CS pin.
	return SPIreadByte(_mAddress, subAddress);
}

void mReadBytes(uint8_t subAddress, uint8_t * dest, uint8_t count)
{
	// Whether we're using I2C or SPI, read multiple bytes using the
	// accelerometer-specific I2C address or SPI CS pin.
	SPIreadBytes(_mAddress, subAddress, dest, count);
}

void initSPI()
{
	nrf_gpio_cfg_output(_xgAddress); //pinMode(_xgAddress, OUTPUT);
	nrf_gpio_pin_set(_xgAddress); // digitalWrite(_xgAddress, HIGH);
	nrf_gpio_cfg_output(_mAddress); // pinMode(_mAddress, OUTPUT);
	nrf_gpio_pin_set(_mAddress); // digitalWrite(_mAddress, HIGH);
	
	/*
	SPI.begin();
	// Maximum SPI frequency is 10MHz, could divide by 2 here:
	SPI.setClockDivider(SPI_CLOCK_DIV2);
	// Data is read and written MSb first.
	SPI.setBitOrder(MSBFIRST);
	// Data is captured on rising edge of clock (CPHA = 0)
	// Base value of the clock is HIGH (CPOL = 1)
	SPI.setDataMode(SPI_MODE0);
	*/
}

void SPIwriteByte(uint8_t csPin, uint8_t subAddress, uint8_t data)
{
	nrf_gpio_pin_clear(csPin); // digitalWrite(csPin, LOW); // Initiate communication
	
	// If write, bit 0 (MSB) should be 0
	// If single write, bit 1 should be 0
	SPItransfer(subAddress & 0x3F);
	SPItransfer(data);
	nrf_gpio_pin_set(csPin); // digitalWrite(csPin, HIGH); // Close communication
}

uint8_t SPItransfer(uint8_t txData)
{
	uint8_t p_tx_data;
	uint8_t p_rx_data;
	p_tx_data = txData;
	uint32_t err_code = nrf_drv_spi_transfer(b_LSMSPI, &p_tx_data, 1, &p_rx_data, 1);
	//APP_ERROR_CHECK(err_code);
	return p_rx_data;
}

uint8_t SPIreadByte(uint8_t csPin, uint8_t subAddress)
{
	uint8_t temp;
	// Use the multiple read function to read 1 byte. 
	// Value is returned to `temp`.
	SPIreadBytes(csPin, subAddress, &temp, 1);
	return temp;
}

void SPIreadBytes(uint8_t csPin, uint8_t subAddress,
							uint8_t * dest, uint8_t count)
{

	// To indicate a read, set bit 0 (msb) of first byte to 1
	uint8_t rAddress = 0x80 | (subAddress & 0x3F);
	// Mag SPI port is different. If we're reading multiple bytes, 
	// set bit 1 to 1. The remaining six bytes are the address to be read
	if ((csPin == _mAddress) && count > 1)
		rAddress |= 0x40;
	
	nrf_gpio_pin_clear(csPin); // digitalWrite(csPin, LOW); // Initiate communication
	SPItransfer(rAddress);	// SPI.transfer(rAddress);
	for (int i=0; i<count; i++)
	{
		dest[i] = SPItransfer(0x00); // SPI.transfer(0x00); // Read into destination array
	}
	nrf_gpio_pin_set(csPin); // digitalWrite(csPin, HIGH); // Close communication
}
